Repository: LaSTiqq/blog
Catalog: locale/*/LC_MESSAGES/django.po
Languages: lv

source: Blog
lv: Blogs

source: This section features my personal solutions to problems I've faced and existing solutions I've modified. While they may not be entirely original, they can still be a valuable resource to complement existing materials. It's a compilation of my experiences and knowledge, shared for the benefit of others
lv: Šī sadaļa ietver sevī manus personīgos risinājumus jau esošajām un jaunajām problēmām, ar kurām biju sastapies. Raksti var nebūt unikāli, bet tie var būt labs papildinājums jau esošajiem materiāliem. Tas ir manas pieredzes un zināšanu krājums, ar kuru vēlos dalīties

source: Images may not display properly due to issues with the hosting service, which is separate from the website's host
lv: Attēli var neielādēties līdz ar problēmām uzturētāja pusē, kas ir atšķirīgs no mājaslapas uzturētāja

source: Tag
lv: Tags

source: Sort by tag
lv: Šķirot pēc taga

source: Read more
lv: Lasīt vairāk

source: Last updated
lv: Atjaunots

source: Created at
lv: Izveidots

source: Articles
lv: Raksti

source: All related articles with
lv: Visi saistītie raksti ar

source: Back to all articles
lv: Atpakaļ pie visiem rakstiem

source: About
lv: Par mani

source: When I began to work on my diploma project I fell in love with creating websites
lv: Kad es uzsāku darbu pie sava diplomprojekta, es iemīlējos mājaslapu izveidē

source: As a relatively new developer, my portfolio is limited with only a few real projects to showcase, but I am proud of what I have accomplished so far
lv: Kā relatīvi jauns izstrādātājs, mans portfolio ir ierobežots vien ar dažiem reāliem projektiem, bet esmu lepns ar padarīto līdz šim

source: There is supposed to be one more SPA website but it's currently under development
lv: Šeit ir jābūt vēl vienai SPA mājaslapai, bet tā pašlaik tiek izstrādāta

source: My current
lv: Mans esošais

source: project dedicated to
lv: projekts, kas veltīts

source: Overall information
lv: Kopējā informācija

source: Qualification
lv: Kvalifikācija

source: Software engineer (bachelors degree)
lv: Programmēšanas inženieris (bakalaura grāds)

source: Graduated
lv: Absolvēta

source: Rezekne Academy of Technologies
lv: Rēzeknes Tehnoloģiju akadēmija

source: Current status
lv: Esošais statuss

source: Looking for a job
lv: Darba meklējumos

source: Preferable position
lv: Vēlamā pozīcija

source: (or similar)
lv: (vai līdzīgi)

source: Closest plans
lv: Tuvākie plāni

source: As a self-driven and responsible developer, I believe that my learning journey should never come to an end. My next learning objectives are
lv: Kā patstāvīgs un atbildīgs izstrādātājs, es uzskatu, ka mans ceļojums kaut kā jauna apgūšanā nekad nedrīkst beigties. Mani nākamie apgūstāmie mērķi ir

source: Start learning
lv: Uzsākt apgūt

source: Keep learning
lv: Turpināt uzlabot zināšanas par

source: and
lv: un

source: Keep using and remembering
lv: Turpināt atcerēties un izmantot

source: Learn
lv: Apgūt

source: and/or
lv: un/vai

source: maybe
lv: iespējams

source: Other
lv: Cits

source: Technologies
lv: Tehnoloģijas

source: The following is a list of programming languages, frameworks, libraries etc. that I have come across in my brief time as a developer
lv: Saraksts zemāk satur programmēšanas valodas, satvarus, bibliotēkas utt., kuras es paspēju izmantot savā īsā izstrādātāja karjerā

source: Highlighted
lv: Izceltie

source: items mean that I used them outside my study process and have some real experience
lv: vārdi nozīmē, ka es tos lietoju ārpus sava studiju procesa un man ir kāda reāla pieredze

source: Frontend tools
lv: Frontend rīki

source: Programming languages
lv: Programmēšanas valodas

source: Frameworks
lv: Satvari

source: Additional
lv: Papildus

source: Deploying SPA websites on
lv: SPA mājaslapu publicēšana iekš

source: Useful resources
lv: Noderīgi resursi

source: The following is a list of most of the resources I utilize in my work
lv: Saraksts zemāk satur resursus, kurus izmantoju savā darbā

source: Thoughts
lv: Domas

source: Efficient use of search engines can often resolve the majority of issues. ChatGPT makes all easier at least twice
lv: Efektīva meklēšanas resursu izmantošana var bieži atrisināt lielāko daļu problēmu. ChatGPT padara šo vismaz divkārt vieglāku

source: Continuous learning is crucial for success as a programmer
lv: Nebeidzoša kaut kā jauna apgūšana ir kritiski svarīga, lai būt par sekmīgu programmētāju

source: Improve English as much as you can
lv: Uzlabo angļu valodu tik daudz, cik vari

source: Django site admin
lv: Django lapas administrātors

source: Django administration
lv: Django administrācija

source: Move backward
lv: Atpakaļ

source: Notice that cookies are used for the full functioning of this website. By continuing, you agree to the use of them
lv: Informējam, ka šīs mājaslapas pilnvērtīgai darbībai tiek izmantotas sīkdatnes (angļu val. "cookies"). Turpinot izmantot šo mājaslapu, Jūs piekrītat to izmantošanai

source: What are the cookies
lv: Kas ir cookies

source: Accept and close
lv: Piekrist un aizvērt

source: Page is available in three languages with potential translation variations
lv: Lapa ir pieejama trijās valodās, ar tulkojumiem, kuri var atšķirties
