Repository: LaSTiqq/blog
Catalog: blog/locale/*/LC_MESSAGES/django.po
Languages: lv, ru

source: Blog
lv: Blogs
ru: Блог

source: This section contains my personal solutions to the problems that I have encountered, as well as those solutions that exist, but which I have modified.
lv: Šajā sadaļā apkopoti mani personīgie risinājumi, kā arī tie risinājumi, atbildes uz kuriem jau eksistē, un es tos pielāgoju savām vajadzībām.
ru: В данном разделе собраны мои личные решения проблем, с которыми я сталкивался, а также те решения, которые существуют, но которые я видоизменял.

source: The articles do not claim to be unique, but they can be a good addition to the materials that already are available.
lv: Raksti var nebūt unikāli, taču tie var būt labs papildinājums jau esošajiem materiāliem.
ru: Статьи не претендуют на уникальность, однако могут быть хорошим дополнением к уже доступным материалам.

source: This is a collection of my knowledge and experience, which I want to share with others.
lv: Tas ir manas zināšanu un pieredzes krājums, ar kuru es gribu dalīties ar citiem.
ru: Это сборник моих знаний и опыта, которым я хочу делиться с другими.

source: The knowledge base will be supplemented with new articles as the author has free time
lv: Zināšanu bāze tiks papildināta ar jauniem rakstiem tiklīdz autoram ir brīvais laiks
ru: База знаний будет дополняться новыми статьями по мере появления у автора свободного времени

source: Tag
lv: Tags
ru: Тэг

source: Sort by tag
lv: Šķirot pēc taga
ru: Сортировать по тэгу

source: Read more
lv: Lasīt vairāk
ru: Читать дальше

source: Last updated
lv: Atjaunots
ru: Обновлено

source: Created at
lv: Izveidots
ru: Создано

source: All related articles with
lv: Visi saistītie raksti ar
ru: Все связанные статьи с

source: Back to all articles
lv: Atpakaļ pie visiem rakstiem
ru: Обратно ко всем статьям

source: About me
lv: Par mani
ru: Про меня

source: I in 2016 year
lv: Es 2016. gadā
ru: Я в 2016 году

source: Hi! My name is Lauris
lv: Čau! Mani sauc Lauris
ru: Привет! Меня зовут Лаурис

source: In summer 2021 I succesfully graduated
lv: 2021. gada vasarā es veiksmīgi absolvēju
ru: Летом 2021 года я успешно окончил

source: Rezekne Academy of Technologies
lv: Rēzeknes Tehnoloģiju akadēmiju
ru: Резекненскую Академию Технологий

source: and got bachelors degree as software engineer
lv: un ieguvu bakalaura grādu, kā programmēšanas inženieris
ru: и получил степень бакалавра, как программист-инженер

source: When I was working on my diploma project I realised that in programming, WEB development attracts me the most. I fell in love with creating websites
lv: Kad es strādāju pie sava diplomprojekta, es sapratu, ka programmēšanā mani visvairāk piesaista WEB izstrāde. Es iemīlējos mājaslapu taisīšanā
ru: Когда я работал над своим дипломным проектом, я понял, что больше всего в программировании меня привлекает WEB разработка. Я влюбился в создание сайтов

source: Since march 2021 till february 2022 I participated in a project where I've developed
lv: No 2021. gada marta līdz 2022. gada februārim es piedalījos projektā, kur es izstrādāju
ru: С марта 2021 года до февраля 2022 года я учавствовал в проекте, где разработал

source: website for local company
lv: mājaslapu vietējam uzņēmumam
ru: сайт для местной фирмы

source: I keep growing as WEB developer and I think that I'm ready for gradual start at the freelance field
lv: Es turpinu augt kā WEB izstrādātājs un es domāju, ka esmu gatavs mērenam startam freelance tirgū
ru: Я продолжаю расти, как WEB разработчик и считаю, что готов для постепенного старта в сфере фриланса

source: This website I developed to tell my story, to demonstrate what I already can do, and to describe what I can currently offer to you
lv: Es izstrādāju šo mājaslapu, lai pastāstīt par sevi, nodemonstrēt, ko es jau māku un aprakstīt, ko es pašlaik varu piedāvāt Jums
ru: Я разработал этот сайт, чтобы рассказать свою историю, продемонстрировать, что я уже умею и что я могу уже сейчас предложить Вам

source: Table of contents
lv: Satura rādītājs
ru: Содержание

source: Technologies
lv: Tehnoloģijas
ru: Технологиии

source: Diploma
lv: Diploms
ru: Диплом

source: Services and prices
lv: Pakalpojumi un cenas
ru: Услуги и цены

source: Portfolio
ru: Портфолио

source: Contacts
lv: Kontakti
ru: Контакты

source: What I work with?
lv: Ar ko es strādāju?
ru: С чем я работаю?

source: As usual, every WEB developer knowledge is based on three whales below
lv: Pamatā, katra WEB izstrādātaja zināšanas ir balstītas uz trim vaļiem zemāk
ru: Как принято, знания каждого WEB разработчика основаны на трех китах ниже

source: Skeleton of every website
lv: Katras mājaslapas skelets
ru: Скелет каждого сайта

source: Place where skeleton get some dress
lv: Vieta, kur skelets iegūst apģērbu
ru: Место, где скелет приобретает одежду

source: Place where skeleton learns to move
lv: Vieta, kur skelets mācās kustēties
ru: Место, где скелет учится двигаться

source: Next are CSS tools which extends styling options
lv: Nākošie ir CSS rīki, kuri paplašina stilizācijas iespējas
ru: Следующими идут CSS инструменты, которые расширяют возможности стилизации

source: One of the main usage benefits - it allows easily make adaptive design for websites (for tablets, phones)
lv: Viens no galvenajiem ieguvumiem ir iespēja viegli veidot adaptīvus dizainus mājaslapām (planšetēm, telefoniem)
ru: Одно из главных достоинств - позволяет легко делать адаптивные дизайны сайтов (для планшетов, телефонов)

source: SCSS is main syntax of SASS. Increases speed of writing styles by optimized syntax of CSS
lv: SCSS ir galvenā SASS sintakse. Paātrina stilu rakstīšanu ar optimizētu CSS sintaksi
ru: SCSS это главный синтаксис SASS. Ускоряет написание стилей оптимизированным синтаксисом CSS

source: Mentioned above technologies usually are called as frontend technologies
lv: Minētās augstāk tehnoloģijas parasti sauc par frontend tehnoloģijām
ru: Перечисленные выше технологии принято называть технологиями фронтенда

source: Next are backend technologies which allows publish websites to the Internet and maintain them
lv: Nākošās ir backend tehnoloģijas, kuras ļauj publicēt mājaslapas internetā un uzturēt tās
ru: Ниже перечислены технологиии бекенда, которые позволяют публиковать сайты в интернет и поддерживать их

source: Young programmers friendly programming language
lv: Draudzīga jaunajiem programmētājiem programmēšanas valoda
ru: Дружелюбный к молодым программистам язык программирования

source: Python based WEB framework
lv: Uz Python balstīts WEB satvars
ru: WEB фреймворк на языке Python

source: The last one thing for many websites is database. Currently I'm using these two
lv: Pēdējais, kas ir vajadzīgs daudzām mājaslapām ir datubāze. Pašlaik es izmantoju
ru: Последнее для многих сайтов это база данных. Обычно я использую этих двух

source: Database for production purposes. One of the most simplest and popular databases
lv: Datubāze "produkcijas" nolūkiem. Viena no vienkāršakajām un populārākajām datubāzēm
ru: База данных для развертывания. Одна из простейших и популярных баз данных

source: Database for testing purposes. The SQLite is default short-hand database in Django
lv: Datubāze "testēšanas" nolūkiem. SQLite ir noklusējuma saīsinātā datubāze iekš Django
ru: База данных для тестирования. SQLite в Django это сокращенная база данных по умолчанию

source: Proof of quality!
lv: Kvalitātes garants!
ru: Гарант качества!

source: To make it easier to believe in my story I provide my diploma scan as proof of my qualification
lv: Lai būtu vieglāk noticēt manā stāstā, es parādu sava diploma skenēto variantu kā pierādījumu savai kvalifikācijai
ru: Чтобы было проще поверить в мой рассказ, я предоставляю в качестве доказательства своей квалификации скан своего диплома

source: What I can offer?
lv: Ko es varu piedāvāt?
ru: Что я могу предложить?

source: Frontend
ru: Фронтенд

source: Template building
lv: Šablonu struktūras uzbūve
ru: Построение структуры шаблона

source: Styling
lv: Stilizācija
ru: Стилизация

source: Interactivity
lv: Interaktivitāte
ru: Интерактивность

source: Adaptive design for phones and tablets
lv: Adaptīvs dizains telefoniem un planšetēm
ru: Адаптивный дизайн для телефонов и планшетов

source: Possibility to follow the progress on
lv: Iespēja sekot progresam caur
ru: Возможность следить за прогрессом на

source: Preferable and relatively fast
lv: Vēlami un relatīvi ātri
ru: Предпочтительно и относительно быстро

source: Average price range
lv: Aptuvenais cenu diapazons
ru: Приблизительный диапазон цен

source: Backend
ru: Бекенд

source: Backend logic on Django
lv: Backenda loģika uz Django
ru: Логика бекенда на Django

source: Login, admin, comments etc. functionality
lv: Ielogošanās, administrēšana, komentāri uc. funkcionalitātes
ru: Логин, админ, комментарии и др. функциональности

source: Database connection (if necessary)
lv: Datubāzes pieslēgšana (ja nepieciešams)
ru: Подключение базы данных (если необходимо)

source: Moving to production
lv: Pāreja uz "produkcijas" režīmu
ru: Развертывание сайта

source: Only relatively simple cases
lv: Tikai relatīvi viegli gadījumi
ru: Только относительно простые случаи

source: Non-preferable and might take some time
lv: Nav vēlamais un var būt laikietilpīgi
ru: Не предпочтительно и может потребовать больше времени

source: Prices are set very approximately. We all can discuss personally
lv: Cenas noteiktas ļoti aptuveni. Mēs visu varam apspriest personīgi
ru: Цены установлены очень приблизительно. Мы можем все обсудить лично

source: Current examples of my work
lv: Pašlaik pieejamie mana darba piemēri
ru: Текущие примеры моей работы

source: Recently I worked in a project where I've developed
lv: Nesen es strādāju projektā, kur es izstrādāju
ru: Не так давно я работал в проекте, где разработал

source: website for local company. It was my first real work as WEB developer. It's the first example
lv: mājaslapu vietējam uzņēmumam. Tas bija mans pirmais reālais darbs, kā WEB izstrādātājam. Tas ir pirmais piemērs
ru: сайт для местной фирмы. Это была моя первая реальная работа в качестве WEB разработчика. Это первый пример

source: Second example you're seeing now. I tried my best to build and design this website completely different from the previous one. Backend was included
lv: Otro piemēru Jūs redzat tagad. Es centos izveidot pavisam savādāku mājaslapu, ar jaunu dizainu, kas atšķirtos no iepriekšējās. Backend tika izmantots
ru: Второй пример Вы видите сейчас. Я старался сделать совершенно не похожий на предыдущий сайт. Бекенд был использован

source: Both of the websites are adaptive
lv: Abas mājaslapas ir adaptīvas
ru: Оба сайта адаптивны

source: I expect that further examples will be available at the freelance website where I'm planning collect not just more examples but also feedbacks
lv: Es plānoju, ka visi tālākie piemēri būs pieejami freelance biržā, kur es taisos ievākt gan jaunus piemērus, gan atsauksmes
ru: Я предполагаю, что дальнейшие примеры будут доступны на бирже фриланса, где я планирую собирать не только примеры работ, но и отзывы

source: Django site admin
lv: Django lapas administrātors
ru: Администратор сайта Django

source: Django administration
lv: Django administrācija
ru: Django администрирование

source: Lauris Stirna. Frontend developer: template building, styling, interactivity. Individual approach
lv: Lauris Stirna. Frontend izstrādātājs: šablona struktūras izbūve, stilizācija, interaktivitāte. Individuāla pieeja
ru: Лаурис Стирна. Фронтенд разработчик: построение структуры шаблона, стилизация, интерактивность. Индивидуальный подход

source: Move backward
lv: Atpakaļ
ru: Назад

source: Move forward
lv: Uz priekšu
ru: Вперёд

source: Cookies
lv: Cepumi
ru: Печенья

source: This site uses "cookies". By continuing you agree to use of it
lv: Informējam, ka šīs mājaslapas pilnvērtīgai darbībai tiek izmantotas sīkdatnes (angļu val. "cookies"). Turpinot izmantot šo mājaslapu, Jūs piekrītat sīkdatņu izmantošanai
ru: Этот сайт использует куки (cookies). Продолжая, вы соглашаетесь на их использование

source: What are the cookies?
lv: Kas ir cepumi?
ru: Что такое куки?

source: Accept and close
lv: Piekrist un aizvērt
ru: Согласиться и закрыть

source: Page is translated into three languages but translations may vary
lv: Lapa ir iztulkota trijās valodās, bet tulkojumi var atšķirties
ru: Страница переведена на три языка, но переводы могут отличаться

source: Go up
lv: Uz augšu
ru: Наверх
